-- phpMyAdmin SQL Dump
-- version 4.3.11
-- http://www.phpmyadmin.net
--
-- Host: 127.0.0.1
-- Generation Time: 2015-10-30 08:03:29
-- 服务器版本： 5.6.24
-- PHP Version: 5.6.8

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- Database: `baidunews`
--
CREATE DATABASE IF NOT EXISTS `baidunews` DEFAULT CHARACTER SET utf8 COLLATE utf8_general_ci;
USE `baidunews`;
-- --------------------------------------------------------

--
-- 表的结构 `news`
--

CREATE TABLE IF NOT EXISTS `news` (
  `news_id` int(11) NOT NULL,
  `news_sort` varchar(20) CHARACTER SET utf8 NOT NULL,
  `news_type` varchar(20) CHARACTER SET utf8 NOT NULL,
  `news_title` varchar(100) CHARACTER SET utf8 NOT NULL,
  `news_img` text CHARACTER SET utf8 NOT NULL,
  `news_content` text CHARACTER SET utf8 NOT NULL,
  `news_from` varchar(20) CHARACTER SET utf8 NOT NULL,
  `news_date` varchar(20) NOT NULL
) ENGINE=InnoDB AUTO_INCREMENT=95 DEFAULT CHARSET=latin1;

--
-- 转存表中的数据 `news`
--

INSERT INTO `news` (`news_id`, `news_sort`, `news_type`, `news_title`, `news_img`, `news_content`, `news_from`, `news_date`) VALUES
(2, 'navfam', '焦点图', '标题', '/img/t2.jpg', '内容1', '作者', '2015-10-22'),
(4, 'navLocal', '焦点图', '标题', '/img/t3.jpg', '内容', '作者', '2015-10-15'),
(5, 'navImg', '焦点图', '标题', '/img/t4.jpg', '内容', '作者', '0000-00-00'),
(8, 'navAmuse', '焦点图', '标题', '/img/t5.jpg', '内容', '作者', '0000-00-00'),
(9, 'navSociety', '焦点图', '标题', '/img/t6.jpg', '内容', '作者', '0000-00-00'),
(10, 'navfam', '滚播', '习近平 全球人物榜', '', '习近平 全球人物榜', '', '2015-10-15'),
(12, 'navLocal', '滚播', '', '', '杨秀珠未获政治庇护', '', '2015-10-22'),
(13, 'navLocal', '滚播', '', '', '京都碰瓷系假消息', '', '2015-10-29'),
(15, 'navRec', '焦点图', '标题', '/img/t1.jpg', '内容啊', '作者', '2015-10-26'),
(16, 'navRec', '滚播', '标题', '配图', '美国反恐英雄遇刺', '作者', '2015-10-28'),
(17, 'navRec', '滚播', '标题', '配图', '美舰拟两周内进南海', '作者', '2015-10-28'),
(18, 'navRec', '滚播', '标题', '配图', '日本为老人碰瓷道歉', '作者', '2015-10-28'),
(19, 'navRec', '新闻', '刘伯明晋升少将 神舟五六七号6航天员均成少将', '/img/r1.jpg', '哈哈', '凤凰头条', '2015-10-28'),
(20, 'navRec', '新闻', '湖南岳阳原副市长被公诉 被指"一天一瓶茅台"', '/img/r2.jpg', '', '凤凰头条', '2015-10-29'),
(21, 'navRec', '新闻', 'IMF总裁拉加德：中国经济并非“前景黯淡”', '/img/r3.jpg', '', '新浪新闻', '2015-10-29'),
(22, 'navLocal', '滚播', '', '', '昆凌产后瘦身内幕', '', '2015-10-22'),
(23, 'navfam', '滚播', '屠呦呦旧居卖1.5亿', '', '屠呦呦旧居卖1.5亿', '', '2015-10-29'),
(24, 'navfam', '滚播', '标题', '', '滴滴获专车牌照', '', '2015-10-29'),
(25, 'navRec', '新闻', '曝巴萨冬窗天价挖罗伊斯 锋线追拉维奇', '/img/r4.jpg', '', '凤凰新闻', '2015-10-28'),
(26, 'navRec', '新闻', '袁隆平：请别再向超级稻泼脏水 锋线追拉维奇', '/img/r5.jpg', '', '凤凰新闻', '2015-10-28'),
(27, 'navRec', '新闻', '日方就“碰瓷乌龙”向大妈致歉', '/img/r6.jpg', '', '凤凰新闻', '2015-10-28'),
(28, 'navRec', '新闻', '蔡国庆自曝母亲因文革患上精神疾病', '/img/r7.jpg', '', '凤凰新闻', '2015-10-28'),
(29, 'navRec', '新闻', '董子健与张艾嘉忘年吻 眼神孤独感迷人', '/img/r8.jpg', '', '凤凰新闻', '2015-10-28'),
(30, 'navRec', '新闻', '美联储会议纪要:9月暂不加息', '/img/r9.jpg', '', '凤凰新闻', '2015-10-28'),
(31, 'navfam', '新闻', '马云首张油画拍出3300万', '/img/s1.jpg', '摘要《桃花源》是马云与中国艺术家曾梵志携手', '凤凰新闻', '2015-10-28'),
(32, 'navfam', '新闻', '英超新赛季下课首人！保级队宣布欧洲名帅辞职', '/img/s2.jpg', '', '新浪要闻', '2015-10-28'),
(33, 'navfam', '新闻', '意大利启动大众排放造假调查', '/img/s3.jpg', '理由是这家公司涉嫌误导购买柴油车的意大利消费者。', '新浪要闻', '2015-10-28'),
(34, 'navfam', '新闻', '龙卷风突袭顺德 致3死近80伤', '/img/s4.jpg', '', '新浪要闻', '2015-10-28'),
(35, 'navfam', '新闻', '习主席访美开辟中美人文交流新天地', '/img/s5.jpg', '', '新浪要闻', '2015-10-28'),
(36, 'navfam', '新闻', '预计2015年赴泰的中国高端游客约38万人次', '/img/s6.jpg', '', '腾讯要闻', '2015-10-28'),
(37, 'navfam', '新闻', '中美在全球治理领域的共识', '/img/s7.jpg', '中美在完善全球经济治理格局方面具有广泛的战略共识。', '专题', '2015-10-28'),
(38, 'navfam', '新闻', 'SpaceX 的新火星计划，就是扔个氢弹', '/img/s8.jpg', '', '凤凰头条', '2015-10-28'),
(39, 'navfam', '新闻', '深圳楼市金九失色：一手住宅成交套数环比下降32%', '/img/s9.jpg', '', '凤凰头条', '2015-10-28'),
(40, 'navLocal', '滚播', '', '', '杨子黄圣依秀恩爱', '', '2015-10-29'),
(41, 'navLocal', '新闻', '看“象”吞“象”时 一把手如何话事？', '/img/l1.jpg', '', '凤凰头条', '2015-10-28'),
(42, 'navLocal', '新闻', '家乐福启动入华20年来最大规模变革', '/img/l2.jpg', '', '凤凰头条', '2015-10-28'),
(43, 'navLocal', '新闻', 'uber成立“雾博”，滴滴拿到牌照，然后呢？', '/img/l3.jpg', '', '腾讯新闻', '2015-10-28'),
(44, 'navLocal', '新闻', '美团大众点评合并：明争结束 暗斗开始', '/img/l4.jpg', '', '腾讯新闻', '2015-10-28'),
(45, 'navLocal', '新闻', '闭环式教育是未来，但互联网首先要回归连接本质', '/img/l5.jpg', '', '腾讯新闻', '2015-10-28'),
(46, 'navLocal', '新闻', '合并以后仍值150亿 美团大众看不透的未来或更悲哀', '/img/l6.jpg', '', '网易新闻', '2015-10-28'),
(47, 'navLocal', '新闻', '投资者认为“资本寒冬”是啥？不是没钱，是没好项目', '/img/l7.jpg', '', '网易新闻', '2015-10-28'),
(48, 'navLocal', '新闻', '美团点评合体中的竞争宿命与垄断审查', '/img/l8.jpg', '', '网易新闻', '2015-10-28'),
(49, 'navLocal', '新闻', '德国的难民潮与默克尔的“诺贝尔成色” ', '/img/l9.jpg', '', '网易新闻', '2015-10-28'),
(50, 'navAmuse', '滚播', '', '', '解放军航母仪仗队', '', '2015-10-28'),
(51, 'navAmuse', '滚播', '', '', '东风5B导弹首曝光', '', '2015-10-28'),
(52, 'navAmuse', '滚播', '', '', '战斗机进驻民航机场', '', '2015-10-28'),
(53, 'navAmuse', '滚播', '', '', '中国印度边界谈判', '', '2015-10-28'),
(54, 'navAmuse', '新闻', '小s大尺度提问新人 黄晓明baby难招架', '/img/a1.jpg', '', '新浪新闻', '2015-10-28'),
(55, 'navAmuse', '新闻', '黄晓明将回青岛再办场婚礼', '/img/a2.jpg', '网友表示：能铆足劲儿超越这场婚礼的，是不是只有范冰冰李晨了。', '新浪新闻', '2015-10-28'),
(56, 'navAmuse', '新闻', '金星称婚礼是为展现权力荣耀', '/img/a3.jpg', '认为，大的仪式就是封圣，往上层爬，同时宣布给世人看，我的权力与荣耀。', '新浪新闻', '2015-10-28'),
(57, 'navAmuse', '新闻', '《肿瘤君》冲奥 韩延成80后首位申奥导演', '/img/a4.jpg', '', '新浪新闻', '2015-10-28'),
(58, 'navAmuse', '新闻', '5566孙协志承认离婚 呼吁大众相信爱情', '/img/a5.jpg', '', '腾讯新闻', '2015-10-28'),
(59, 'navAmuse', '新闻', '陈珊妮开启内地巡演 丁丁张周笔畅将助阵', '/img/a6.jpg', '', '腾讯新闻', '2015-10-28'),
(60, 'navAmuse', '新闻', '传黄子韬加盟《铁道飞虎》 导演未否认', '/img/a7.jpg', '', '搜狐新闻', '2015-10-28'),
(61, 'navAmuse', '新闻', '配乐大师威廉姆斯获美电影学院终身成就奖', '/img/a8.jpg', '', '搜狐新闻', '2015-10-28'),
(62, 'navAmuse', '新闻', '《琅琊榜》虐心苏兄如何养成', '/img/a9.jpg', '', '搜狐新闻', '2015-10-28'),
(63, 'navSociety', '滚播', '', '', '歼20明年或批量生产', '', '2015-10-28'),
(64, 'navSociety', '滚播', '', '', '世界军力排行出炉', '', '2015-10-28'),
(65, 'navSociety', '滚播', '', '', '台湾举行抗战阅兵', '', '2015-10-28'),
(66, 'navSociety', '新闻', '中国人屠呦呦获诺贝尔医学奖#中医黑请出动', '/img/m1.jpg', '', '凤凰新闻', '0000-00-00'),
(67, 'navSociety', '新闻', '各位O2O土豪，地推不是万能的，还有移动广告呢！', '/img/m2.jpg', '', '凤凰新闻', '2015-10-28'),
(68, 'navSociety', '新闻', '英国一男子因入侵摄像头观看户主做爱被判刑', '/img/m3.jpg', '', '凤凰新闻', '2015-10-28'),
(69, 'navSociety', '新闻', 'Gartner：可颠覆IT产业的十大战略预测', '/img/m4.jpg', '', '腾讯要闻', '2015-10-28'),
(70, 'navSociety', '新闻', '为什么柳岩总在“晒胸”？', '/img/m5.jpg', '一则是她在综艺节目里，用胸口托宠物，风情又颇风趣.', '腾讯要闻', '2015-10-28'),
(71, 'navSociety', '新闻', '阿里不做，百度不做，为啥这家公司一定能做成？', '/img/m6.jpg', '', '腾讯要闻', '2015-10-28'),
(72, 'navSociety', '新闻', '英国对中国，单相思久矣	', '/img/m7.jpg', '', '搜狐新闻', '2015-10-28'),
(73, 'navSociety', '新闻', '单体酒店陷颓势，酒店行业开启连锁大时代	', '/img/m8.jpg', '', '搜狐新闻', '2015-10-28'),
(74, 'navImg', '滚播', '', '', '俄罗斯密集空袭IS', '', '2015-10-28'),
(75, 'navImg', '滚播', '', '', '台湾举行抗战阅兵', '', '2015-10-28'),
(76, 'navImg', '滚播', '', '', '台抹阅兵战机日国旗', '', '2015-10-28'),
(77, 'navImg', '滚播', '', '', '女兵扛4公斤枪训练', '', '2015-10-28'),
(78, 'navImg', '新闻', '陈柏霖 还是那个痴情的大仁哥	', '/img/p1.jpg', '', '', '2015-10-28'),
(79, 'navImg', '新闻', '阿扎尔向新浪公布手机私照	', '/img/p2.jpg', '', '', '2015-10-28'),
(80, 'navImg', '新闻', '吕良伟夫妇外出喝茶 妻子撒娇紧搂丈夫	', '/img/p3.jpg', '', '', '2015-10-28'),
(81, 'navImg', '新闻', '快船深圳训练遭围堵 小乔丹大笑	', '/img/p4.jpg', '', '', '2015-10-28'),
(82, 'navImg', '新闻', '黄晓明兄弟团抢亲被捆 baby男闺蜜扮女装', '/img/p5.jpg', '', '', '2015-10-28');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `news`
--
ALTER TABLE `news`
  ADD PRIMARY KEY (`news_id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `news`
--
ALTER TABLE `news`
  MODIFY `news_id` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=95;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
